In [1]:
#Importing basic libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

# Exploring & Cleaning Training data

In [2]:
#Importing training data
train=pd.read_excel('Train.xlsx')

In [3]:
#Checking 5 top rows
train.head()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,1.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,2.0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,1.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,1.0
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,1.0

In [4]:
#Checking shape of dataset
train.shape

(891, 12)

In [5]:
#Checking info of each column
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Gender       891 non-null    int64
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    float64
dtypes: float64(3), int64(6), object(3)
memory usage: 83.7+ KB

In [6]:
#Checking number of null values in each column
train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Gender           0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [7]:
#Calculating mean of Age column
Mean_Age=train.Age.mean()

In [8]:
Mean_Age

29.69911764705882

In [10]:
#Filling N/A's in Age column with Mean
train['Age']=train.Age.fillna(Mean_Age)

In [11]:
train.Age.isna().sum()

0

In [13]:
#Converting Age to an Integer column
train['Age']=train.Age.astype(int)

In [15]:
#Finding Mode of Embarked column
Mode_Emb=train.Embarked.mode()

In [16]:
Mode_Emb

0    1.0
dtype: float64

In [20]:
#Filling N/As in Embarked column with Mode
train['Embarked']=train.Embarked.fillna(1)

In [22]:
train.Embarked.isna().sum()

0

In [24]:
#Converting Embarked column to an Integer column
train['Embarked']=train.Embarked.astype(int)

In [26]:
#Dropping columns and assign to new name
train2=train.drop(columns=['PassengerId','Name','Ticket','Cabin'])

In [28]:
train2.head()

   Survived  Pclass  Gender  Age  SibSp  Parch     Fare  Embarked
0         0       3       1   22      1      0   7.2500         1
1         1       1       0   38      1      0  71.2833         2
2         1       3       0   26      0      0   7.9250         1
3         1       1       0   35      1      0  53.1000         1
4         0       3       1   35      0      0   8.0500         1

In [29]:
#Converting Fare to integer
train2['Fare']=train2.Fare.astype(int)

In [31]:
#Final training dataset
train2.shape

(891, 8)

In [32]:
train2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Gender    891 non-null    int64
 3   Age       891 non-null    int32
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Fare      891 non-null    int32
 7   Embarked  891 non-null    int32
dtypes: int32(3), int64(5)
memory usage: 45.4 KB

# Exploring & Cleaning Testing Data

In [33]:
#Importing testing data
test=pd.read_excel('Test.xlsx')

In [34]:
test.head()

,PassengerId,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,NaN,3
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,NaN,1
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,9.6875,NaN,3
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,315154,8.6625,NaN,1
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,NaN,1

In [35]:
#Checking info on columns
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Gender       418 non-null    int64
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    int64
dtypes: float64(2), int64(6), object(3)
memory usage: 36.0+ KB

In [36]:
#Checking null values in columns
test.isna().sum()

PassengerId      0
Pclass           0
Name             0
Gender           0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [37]:
#Calculating mean of Age column
Mean_AgeT=test.Age.mean()

In [38]:
Mean_AgeT

30.272590361445783

In [39]:
#Filling missing N/As in Age column with mean
test['Age']=test.Age.fillna(Mean_AgeT)

In [40]:
test.Age.isna().sum()

0

In [41]:
#Converting Age to an integer column
test['Age']=test.Age.astype(int)

In [42]:
#Calculating mean of Fare
Mean_Fare=test.Fare.mean()

In [43]:
Mean_Fare

35.6271884892086

In [44]:
#Filling missing N/As in Fare column with mean
test['Fare']=test.Fare.fillna(Mean_Fare)

In [45]:
test.Fare.isna().sum()

0

In [46]:
#Converting Fare to an integer column
test['Fare']=test.Fare.astype(int)

In [47]:
#Dropping columns
test2=test.drop(columns=['PassengerId','Name','Ticket','Cabin'])

In [48]:
test2.head()

   Pclass  Gender  Age  SibSp  Parch  Fare  Embarked
0       3       1   34      0      0     7         3
1       3       0   47      1      0     7         1
2       2       1   62      0      0     9         3
3       3       1   27      0      0     8         1
4       3       0   22      1      1    12         1

In [49]:
test2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Gender    418 non-null    int64
 2   Age       418 non-null    int32
 3   SibSp     418 non-null    int64
 4   Parch     418 non-null    int64
 5   Fare      418 non-null    int32
 6   Embarked  418 non-null    int64
dtypes: int32(2), int64(5)
memory usage: 19.7 KB

In [50]:
test2.shape

(418, 7)

# Logistic Regression

In [56]:
#Spliting train data into dependent and Independent variables
X=train2.drop(columns=['Survived'])
y=train2['Survived']

In [52]:
X.head()

   Pclass  Gender  Age  SibSp  Parch  Fare  Embarked
0       3       1   22      1      0     7         1
1       1       0   38      1      0    71         2
2       3       0   26      0      0     7         1
3       1       0   35      1      0    53         1
4       3       1   35      0      0     8         1

In [57]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [59]:
#Spliting train data into train and validity
from sklearn.model_selection import train_test_split
X_train2, X_val, y_train2, y_val = train_test_split(X, y, train_size=0.8, random_state=0)

In [62]:
#Fitting  Logistic Regression to the training set
from sklearn.linear_model import LogisticRegression
logisticRegre=LogisticRegression()
logisticRegre.fit(X_train2, y_train2)

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py:763: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

In [63]:
#predicting the validity data
y_val_predict = logisticRegre.predict(X_val)

In [64]:
y_val_predict

array([0, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1,
       0, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0,
       1, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0,
       1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1,
       0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0,
       0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 0,
       1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0,
       1, 0, 0], dtype=int64)

In [65]:
#Checking performance of the model using validity data
from sklearn.metrics import accuracy_score
accuracy_score(y_val, y_val_predict)

0.8100558659217877

In [66]:
#predicting the test data
test_predict = logisticRegre.predict(test2)

In [67]:
test_predict

array([0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 0,
       1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1,
       1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0,
       1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1,
       0, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1,
       0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0,
       0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0,
       0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0],
      dtype=int64)

In [68]:
#Calculating coefficents
print(logisticRegre.coef_)

[[-1.03724851e+00 -2.55874684e+00 -4.25885764e-02 -3.61004593e-01
  -4.22943632e-02  1.76303663e-03  2.45949156e-01]]

In [69]:
#Exporting outcome to excel
df=pd.DataFrame(test_predict).T
df.to_excel('C:\\Users\\OWNER\\Desktop\\Working_Festman\\Survival2.xlsx',index=False)